app/views/students/edit.html.erb

    <br>
    <%= f.collection_select( :school_id, School.all, :id, :name, prompt: true)%>
---
SELECT "schools".* FROM "schools"