app/views/students/new.html.erb

SELECT "schools".* FROM "schools"
---
    <%=f.label :school_id %>
    <%= f.collection_select( :school_id, School.all, :id, :name, prompt: true)%>