app/views/schools/show.html.erb


    <% @school.students.each do |student| %>
---
SELECT "students".* FROM "students" WHERE "students"."school_id" = ?  [["school_id", 5]]