app/controllers/schools_controller.rb

  def index
    @schools = School.search(params[:search])
---
SELECT "schools".* FROM "schools" WHERE (lower(name) LIKE 'flatiron')