app/controllers/students_controller.rb

INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "jen"], ["age", 12], ["created_at", "2019-06-10 14:50:56.402095"], ["updated_at", "2019-06-10 14:50:56.402095"], ["school_id", 2]]
---
  def create
    @student = Student.new(student_params)
    if @student.valid?
      @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "students" SET "age" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 52], ["updated_at", "2019-06-10 15:03:32.666656"], ["id", 5]]
---
  def update
    @student = Student.find(params[:id])
    if @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
  def destroy
    @student = Student.find(params[:id])
    #@student_school = @student.school
    @student.delete