app/controllers/supports_controller.rb

INSERT INTO "supports" ("name", "email", "reason", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "wefw"], ["email", "wefwef"], ["reason", "ewfwefewf"], ["created_at", "2019-06-10 16:01:35.676272"], ["updated_at", "2019-06-10 16:01:35.676272"]]
---
  def create
    @support = Support.new(support_params)
    if @support.valid?
      @support.save