app/models/school.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."name" = ? LIMIT ?  [["name", "nyu"], ["LIMIT", 1]]
---
    def self.search(search)
        schools =  School.all
        if search && !search.empty?
          schools =  School.where('lower(name) LIKE ?', "%#{search.downcase}%")